package pers.gglt.other.git;

public class Resume {
    /**注意点*/
    // 技术细节不要写进简历，看不懂的直接给你下了
    // 一筛HR关注点，学校，年龄，自我评价，证书来看基础能力和潜力。从项目内容，类型，规模，在项目里的定位来看业务能力

    /**自我介绍*/


    // 熟悉Android手机软件架构，3年以上的Android开发经验；
    // 精通Java语言，熟练掌握Java开发技术，具备扎实的编程基本功和良好的编程习惯；
    // 熟悉面向对象的程序设计方法，熟悉设计模式；
    // 精通多线程编程，精通网络编程，熟悉JNI原理；
    // 精通Android的基本组件使用,熟练使用Android各种布局与控件；
    // 熟悉retrofit 、rxjava 、Fastjson 、EventBus、universal-image-loader、asmack等开源第三方组件；
    // 对Android的Framework有较深入理解，熟悉主流开源组件及各种特性；
    // 熟悉Android平台UI设计，能够熟练使用Android SDK；
    // 性能优化；
    // UI适配


    // 项目经验
    // 智能门禁系统
    // 参与技术选型，重构框架。安卓终端技术栈采用，开发文件断点续传，
    // 项目迭代，性能优化
    // 对接小程序，后台管理系统，PC端
    // 人脸识别，可视对讲，刷卡通行，扫码通行，密码通行
    //

    // 人脸注册时存储faceId，之后进行本地人脸识别
    // 人脸识别流程
    // 打开相机，对相机帧数据进行处理，识别到人脸后提取人脸特征值，并从一个保存人脸特征值的数据集合中找到最匹配的特征值，若特征相似度大于阈值，则识别成功
    //

    // 编写开发过程文档及对外接口文档
    // 版本控制使用Git作为整个APP项目的代码处理

}
